tiborsimon/embedded-tdd-headers/pic/8bit/pic18f4431_tdd.h
#define BRGH1                         522
#define BRGH                          523
#define SENDB1                        524
#define SENDB                         525
#define SYNC                          526
#define SYNC1                         527
#define TXEN1                         528
#define TXEN                          529
#define TX91                          530
#define TX8_9                         531
#define TX9                           532
#define CSRC1                         533
#define CSRC                          534
#define QEICON                        535
#define PDEC                          536
#define PDEC0                         537
#define PDEC1                         538
#define QEIM                          539
#define QEIM0                         540
#define QEIM1                         541
#define QEIM2                         542
#define DOWN                          543
#define nDOWN                         544
#define UP_nDOWN                      545
#define NOT_DOWN                      546
#define UP                            547
#define UPDOWN                        548
#define UP_NOT_DOWN                   549
#define UP_DOWN                       550
#define QERR                          551
#define VELM                          552
#define nVELM                         553
#define NOT_VELM                      554
#define T5CON                         555
#define TMR5ON                        556
#define TMR5CS                        557
#define RD165                         558
#define T5SYNC                        559
#define nT5SYNC                       560
#define NOT_T5SYNC                    561
#define SOSCEN5                       562
#define T5PS0                         563
#define T5PS                          564
#define T5PS1                         565
#define T5MOD                         566
#define nRESEN                        567
#define NOT_RESEN                     568
#define RESEN                         569
#define T5SEN                         570
#define ANSEL0                        571
#define ANS0                          572
#define ANS1                          573
#define ANS2                          574
#define ANS3                          575
#define ANS4                          576
#define ANS5                          577
#define ANS6                          578
#define ANS7                          579
#define ANSEL1                        580
#define ANS8                          581
#define CCP2CON                       582
#define CCP2M                         583
#define CCP2M0                        584
#define CCP2M1                        585
#define CCP2M2                        586
#define CCP2M3                        587
#define DC2B0                         588
#define CCP2Y                         589
#define DC2B                          590
#define DC2B1                         591
#define CCP2X                         592
#define CCP1CON                       593
#define CCP1M0                        594
#define CCP1M                         595
#define CCP1M1                        596
#define CCP1M2                        597
#define CCP1M3                        598
#define CCP1Y                         599
#define DC1B                          600
#define DC1B0                         601
#define CCP1X                         602
#define DC1B1                         603
#define ADCON2                        604
#define ADCS0                         605
#define ADCS                          606
#define ADCS1                         607
#define ADCS2                         608
#define ACQT0                         609
#define ACQT                          610
#define ACQT1                         611
#define ACQT2                         612
#define ACQT3                         613
#define ADFM                          614
#define ADCON1                        615
#define ADPNT                         616
#define ADPNT0                        617
#define ADPNT1                        618
#define FFOVFL                        619
#define BFOVFL                        620
#define CHSN3                         621
#define BFEMT                         622
#define FIFOEN                        623
#define VCFG01                        624
#define VCFG                          625
#define VCFG0                         626
#define VCFG1                         627
#define ADCON0                        628
#define ADON                          629
#define GODONE                        630
#define nDONE                         631
#define GO_nDONE                      632
#define NOT_DONE                      633
#define GO_DONE                       634
#define DONE                          635
#define GO                            636
#define GO_NOT_DONE                   637
#define ACMOD0                        638
#define ACMOD                         639
#define ACMOD1                        640
#define ACSCH                         641
#define ACONV                         642
#define SSPCON                        643
#define SSPM0                         644
#define SSPM                          645
#define SSPM1                         646
#define SSPM2                         647
#define SSPM3                         648
#define CKP                           649
#define SSPEN                         650
#define SSPOV                         651
#define WCOL                          652
#define SSPSTAT                       653
#define BF                            654
#define UA                            655
#define R_NOT_W                       656
#define READ_WRITE                    657
#define NOT_W                         658
#define nW                            659
#define RW                            660
#define nWRITE                        661
#define R                             662
#define NOT_WRITE                     663
#define R_nW                          664
#define R_W                           665
#define START                         666
#define S                             667
#define STOP                          668
#define P                             669
#define NOT_A                         670
#define nA                            671
#define D_A                           672
#define D_nA                          673
#define D                             674
#define DA                            675
#define DATA_ADDRESS                  676
#define D_NOT_A                       677
#define NOT_ADDRESS                   678
#define nADDRESS                      679
#define CKE                           680
#define SMP                           681
#define T2CON                         682
#define T2CKPS0                       683
#define T2CKPS                        684
#define T2CKPS1                       685
#define TMR2ON                        686
#define T2OUTPS0                      687
#define TOUTPS0                       688
#define TOUTPS                        689
#define T2OUTPS1                      690
#define TOUTPS1                       691
#define T2OUTPS2                      692
#define TOUTPS2                       693
#define T2OUTPS3                      694
#define TOUTPS3                       695
#define PR2                           696
#define WM0                           697
#define WM1                           698
#define WAIT0                         699
#define WAIT1                         700
#define EBDIS                         701
#define T1CON                         702
#define TMR1ON                        703
#define TMR1CS                        704
#define NOT_T1SYNC                    705
#define T1SYNC                        706
#define nT1SYNC                       707
#define T1INSYNC                      708
#define T1OSCEN                       709
#define SOSCEN                        710
#define T1CKPS0                       711
#define T1CKPS                        712
#define T1CKPS1                       713
#define T1RUN                         714
#define RD16                          715
#define T1RD16                        716
#define RCON                          717
#define BOR                           718
#define NOT_BOR                       719
#define nBOR                          720
#define POR                           721
#define nPOR                          722
#define NOT_POR                       723
#define nPD                           724
#define NOT_PD                        725
#define PD                            726
#define NOT_TO                        727
#define nTO                           728
#define TO                            729
#define nRI                           730
#define NOT_RI                        731
#define RI                            732
#define nIPEN                         733
#define IPEN                          734
#define NOT_IPEN                      735
#define WDTCON                        736
#define SWDTEN                        737
#define WDTW                          738
#define LVDCON                        739
#define LVDL0                         740
#define LVDL                          741
#define LVDL1                         742
#define LVDL2                         743
#define LVDL3                         744
#define LVDEN                         745
#define IRVST                         746
#define IVRST                         747
#define OSCCON                        748
#define SCS0                          749
#define SCS                           750
#define SCS1                          751
#define FLTS                          752
#define IOFS                          753
#define OSTS                          754
#define IRCF                          755
#define IRCF0                         756
#define IRCF1                         757
#define IRCF2                         758
#define IDLEN                         759
#define T0CON                         760
#define T0PS                          761
#define T0PS0                         762
#define T0PS1                         763
#define T0PS2                         764
#define PSA                           765
#define T0PS3                         766
#define T0SE                          767
#define T0CS                          768
#define T016BIT                       769
#define TMR0ON                        770
#define STATUS                        771
#define C                             772
#define CARRY                         773
#define DC                            774
#define ZERO                          775
#define Z                             776
#define OV                            777
#define OVERFLOW                      778
#define N                             779
#define NEGATIVE                      780
#define INTCON3                       781
#define INT1IF                        782
#define INT1F                         783
#define INT2IF                        784
#define INT2F                         785
#define INT1E                         786
#define INT1IE                        787
#define INT2IE                        788
#define INT2E                         789
#define INT1P                         790
#define INT1IP                        791
#define INT2IP                        792
#define INT2P                         793
#define INTCON2                       794
#define RBIP                          795
#define TMR0IP                        796
#define T0IP                          797
#define INTEDG2                       798
#define INTEDG1                       799
#define INTEDG0                       800
#define RBPU                          801
#define NOT_RBPU                      802
#define nRBPU                         803
#define INTCON                        804
#define RBIF                          805
#define INT0F                         806
#define INT0IF                        807
#define T0IF                          808
#define TMR0IF                        809
#define RBIE                          810
#define INT0E                         811
#define INT0IE                        812
#define T0IE                          813
#define TMR0IE                        814
#define PEIE                          815
#define PEIE_GIEL                     816
#define GIEL                          817
#define GIE_GIEH                      818
#define GIE                           819
#define GIEH                          820
#define STKPTR0                       821
#define STKPTR                        822
#define STKPTR1                       823
#define STKPTR2                       824
#define STKPTR3                       825
#define STKPTR4                       826
#define STKUNF                        827
#define STKOVF                        828
#define STKFUL                        829

#endif // _PIC18F4431_H_
